<?xml version="1.0"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML+RDFa 1.0//EN" "http://www.w3.org/MarkUp/DTD/xhtml-rdfa-1.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">

<head profile="http://www.w3.org/2003/g/data-view">

    <link rel="transformation" href="http://ns.inria.fr/grddl/rdfa/2007/09/19/RDFa2RDFXML.xsl"/>

	<meta http-equiv="content-type" content="application/xhtml+xml; charset=utf-8" />

    <meta name="AUTHOR" content="Diego Berrueta Muñoz" />
    <meta name="COPYRIGHT" content="Copyright (c) 2007 Diego Berrueta Muñoz" />
    <meta name="DESCRIPTION" content="Personal home page and blog of Diego Berrueta" />

    <link rel="alternate" type="application/rss+xml" title="RSS" href="../rss/index.html%3Fsection=blog"/>
    <link rel="meta" type="application/rdf+xml" title="SIOC" href="http://www.w3.org/2007/08/pyRdfa/extract?uri=http://berrueta.net/blog/20040714-1427"/>

	<link rel="home" title="Home" href="../index.html" />

	<link rel="stylesheet" type="text/css" media="screen, projection" href="../sapphire.css" />
	<link rel="stylesheet" type="text/css" media="screen, projection" href="../mine.css" />

	<link rel="stylesheet" type="text/css" media="print" href="../sapphireprint.css" />

	<title>Diego Berrueta: 14 Jul 2004: de la tierra al cielo en Sputnik</title>

</head>



<body>



<div id="frame">



<div id="accessibility">

	<a href="20040714-1427.html#content" title="Go to content">Go to content</a> 

	<a href="20040714-1427.html#nav" title="Go to navigation">Go to navigation</a> 

</div> <!-- closes #accessibility -->



<div id="header">

	<h1><a href="../index.html">Diego Berrueta</a></h1>

	<div id="nav">

		<ul>

			<li><a href="../index.html" title="Return to homepage">Home</a></li>

			<li><a href="../blog.html" title="Read blog posts">Blog</a></li>

			<li><a href="http://www.flickr.com/photos/berrueta/" title="Some of my photos">Gallery</a></li>

		</ul>

<!--
		<p><a href="http://berrueta.net/rss/?section=blog" title="RSS Feed">Subscribe</a></p>
-->

	</div> <!-- closes #nav -->

</div> <!-- closes #header -->



<div id="middle">

<div id="content">

	

<div instanceof="sioc:Forum" xmlns:sioc="http://rdfs.org/sioc/ns#" xmlns:dc="http://purl.org/dc/elements/1.1/" about="http://berrueta.net/blog#berrueta-blog">

	
		<div class="post" instanceof="sioc:Post" xmlns:sioc="http://rdfs.org/sioc/ns#" xmlns:dc="http://purl.org/dc/elements/1.1/" about="http://berrueta.net/blog/20040714-1427" >

		<h2><a rel="bookmark" href="20040714-1427.html"><span property="dc:title">14 Jul 2004: de la tierra al cielo en&#160;Sputnik</span></a></h2>

		<div property="sioc:content">
		  <p>(This is a reprint of <a href="http://www.asturlinux.org/comunidad/node/223">the original post</a>)</p>
<p>Est&#xE1;n a punto de cumplirse 35 a&#xF1;os del <a href="http://www.hq.nasa.gov/office/pao/History/ap11ann/kippsphotos/apollo.html">desembarco del Apolo 11</a> en la superficie de la Luna. Esta efem&#xE9;ride me sirve de excusa para convertir mi entrada de hoy en el diario en un cap&#xED;tulo de mis memorias. Yo no hab&#xED;a nacido aquel d&#xED;a, de hecho, lo que voy a relatar sucedi&#xF3; bastante despu&#xE9;s, al final de los a&#xF1;os ochenta y principios de los noventa.</p>

<p>Seguro que para casi todos los que leen este diario resultar&#xE1; una novedad, pero yo siempre he sido un gran aficionado a la Astron&#xE1;utica. Bueno, he de reconocer que lo era mucho m&#xE1;s antes que ahora, porque ahora me encuentro m&#xE1;s ocupado con otros aspectos de mi vida y con otras aficiones. Yo me sent&#xED;a fascinado por el mundo de las naves espaciales y los astronautas, como me imagino que tambi&#xE9;n lo estaban muchos otros ni&#xF1;os. Por si hay alguien despistado, quiero aclarar antes de nada que la <a href="http://es.wikipedia.org/wiki/Astron%E1utica">Astron&#xE1;utica</a> est&#xE1; relacionada con la construcci&#xF3;n de veh&#xED;culos espaciales. No debe confundirse con la <a href="http://es.wikipedia.org/wiki/Astronom%EDa">Astronom&#xED;a</a> y much&#xED;simo menos con la <a href="http://es.wikipedia.org/wiki/Astrolog%EDa">Astrolog&#xED;a</a>.</p>

<p>A finales de la d&#xE9;cada de los 80, en medio de la EGB, mi mejor amigo se llamaba Miguel. Felizmente, todav&#xED;a conservamos nuestra amistad, aunque ya no nos vemos tan frecuentemente como lo hac&#xED;amos cuando &#xE9;ramos compa&#xF1;eros de clase. Miguel fue el que me contagi&#xF3; su entusiasmo por la Astron&#xE1;utica. Durante unos a&#xF1;os, nos dedic&#xE1;bamos a devorar cualquier texto que encontr&#xE1;semos en los libros, especialmente en las enciclopedias. Nuestro af&#xE1;n era recopilarlos y juntarlos. Recuerdo haberle dicho a mi familia que quer&#xED;amos publicar un libro. Aquella actividad tiene mucho que ver con mi vocaci&#xF3;n posterior hacia la inform&#xE1;tica, aunque ese asunto queda aparcado para otro d&#xED;a. Muchas cosas me quedan a&#xFA;n de aquellos d&#xED;as. Por ejemplo, mi soltura con el teclado (nada despreciable para un ni&#xF1;o de 11 a&#xF1;os), mis primeros conocimientos de dibujo t&#xE9;cnico (aunque luego la profesora de Dibujo T&#xE9;cnico de COU no los apreciara tanto) y sin duda, una soltura con las enciclopedias que deb&#xED; perder en alg&#xFA;n momento, porque hoy en d&#xED;a tengo que concentrarme para recordar la ordenaci&#xF3;n alfab&#xE9;tica.</p>

<p>Hasta 1990, Miguel y yo viv&#xED;amos en el mismo barrio de Oviedo, as&#xED; que compart&#xED;amos muchas tardes aprendiendo e investigando juntos. A partir de esas fechas, yo me mud&#xE9; fuera de Oviedo, y nuestros contactos se hicieron m&#xE1;s espor&#xE1;dicos. No obstante, yo encontr&#xE9; m&#xE1;s amigos con cierto inter&#xE9;s en el asunto, y establecimos un embri&#xF3;n de asociaci&#xF3;n que llamamos, de forma poco ingeniosa, "Grupo D&M". A &#xE9;l llegaron a pertenecer unas 20 personas, todas ellas compa&#xF1;eros del colegio o amigos.</p>

<p>Mientras tanto, yo segu&#xED;a devorando la secci&#xF3;n "Cuenta atr&#xE1;s" de la revista Tribuna de Astronom&#xED;a. Eran s&#xF3;lo dos p&#xE1;ginas de cada n&#xFA;mero, pero era la &#xFA;nica que trataba monogr&#xE1;ficamente de la Astron&#xE1;utica (salvo alg&#xFA;n art&#xED;culo m&#xE1;s amplio, pero excepcional). Aquella secci&#xF3;n estaba escrita por Manuel Montes, que con la llegada de Internet, se pas&#xF3; al mundo digital, y ahora publica un <a href="http://www.amazings.com/ciencia/#notesp">jugos&#xED;simo bolet&#xED;n</a>. Tambi&#xE9;n manten&#xED;a contactos con algunos aficionados de Gij&#xF3;n y de Madrid.</p>

<p>Entonces decid&#xED; dar un paso m&#xE1;s, y escrib&#xED; cartas a diversos centros de las agencias espaciales espa&#xF1;olas, europeas y norteamericanas. En Enero de 1992, sin haber cumplido a&#xFA;n 13 a&#xF1;os, empec&#xE9; a enviar cartas a la <a href="http://www.nasa.gov" target="_parent">NASA</a>, a la <a href="http://www.esa.int/" target="_parent">ESA</a> y al <a href="http://www.inta.es/" target="_parent">INTA</a>, entre otras organizaciones. Y soprendentemente, en todas las ocasiones contestaron (algunas muestras: <a href="http://www.asturlinux.org/~berrueta/sputnik/sobre-nasa.jpg" target="_parent">una</a>, <a href="http://www.asturlinux.org/~berrueta/sputnik/sobre-nasa-2.jpg" target="_parent">dos</a>, <a href="http://www.asturlinux.org/~berrueta/sputnik/sobre-esa.jpg" target="_parent">tres</a> y <a href="http://www.asturlinux.org/~berrueta/sputnik/sobre-esa-2.jpg" target="_parent">cuatro</a>), enviando grandes cantidades de informaci&#xF3;n, fotograf&#xED;as, libros, etc. Est&#xE1; claro que estas agencias cuidan mucho su departamento de relaciones p&#xFA;blicas. La ESA, por ejemplo, sigue envi&#xE1;ndome de forma gratuita un magazine peri&#xF3;dico.</p>

<p>Animado por estos contactos, emprend&#xED; un nuevo proyecto: la publicaci&#xF3;n de una revista. Con la colaboraci&#xF3;n de algunos amigos del Grupo D&M, me convert&#xED; en editor y principal redactor de "Sputnik". La gente de la Casa de la Cultura de Lugones prest&#xF3; una ayuda inestimable, pues se encargaron de los aspectos legales (como el dep&#xF3;sito legal) y de las multicopias.</p>

<p>El <a href="http://www.asturlinux.org/~berrueta/sputnik/sputnik01-p01.jpg" target="_parent">primer n&#xFA;mero</a> sali&#xF3; en Enero de 1993. No recuerdo bien su tirada, pero debi&#xF3; rondar el medio centenar de copias, con un precio simb&#xF3;lico y virtual, pues no se cobraba. Con una periodicidad titubeante, Sputnik lleg&#xF3; a publicar nueve n&#xFA;meros, <a href="http://www.asturlinux.org/~berrueta/sputnik/sputnik09-p01.jpg" target="_parent">el &#xFA;ltimo de ellos</a> en Marzo de 1994. Todos ellos tuvieron entre 20 y 24 p&#xE1;ginas, y mantuvieron su car&#xE1;cter de revista juvenil de divulgaci&#xF3;n cient&#xED;fica muy especializada, aunque en un par de ocasiones recurri&#xF3; levemente al sensacionalismo. En "Sputnik" se pod&#xED;an encontrar art&#xED;culos de opini&#xF3;n (ba&#xF1;ados en ingenuidad juvenil), noticias de actualidad astron&#xE1;utica (sacadas de medios de comunicaci&#xF3;n) y reportajes de enorme rigor en algunos casos, y m&#xE1;s ligeros en otros.</p>

<p>Desde mi perspectiva actual de inform&#xE1;tico, no puedo evitar se&#xF1;alar que la edici&#xF3;n de los n&#xFA;meros mejor&#xF3; muy notablemente conforme yo aprend&#xED;a. Los primeros n&#xFA;meros fueron hechos con un 286 de s&#xF3;lo 1 MB de memoria RAM, utilizando un procesador de textos gen&#xE9;rico (WordPerfect para DOS). Los &#xFA;ltimos n&#xFA;meros, ya con una <a href="http://www.asturlinux.org/~berrueta/sputnik/sputnik08-p10.jpg" target="_parent">maquetaci&#xF3;n mucho m&#xE1;s elaborada</a>, fueron compuestos con un programa espec&#xED;fico para maquetaci&#xF3;n. Pero la copia maestra de todos ellos fue impresa usando una Epson LQ-200 de 24 agujas, que adem&#xE1;s ten&#xED;a una especial capacidad para parar el carro pero seguir imprimiendo, con lo que produc&#xED;a p&#xE1;ginas aut&#xE9;nticamente perforadas, al m&#xE1;s m&#xED;nimo descuido. Conservo todo el material digital usado en la edici&#xF3;n de las revistas, pero en formatos tan antiguos que mis intentos por recuperarlo de esta manera me han llevado a la conclusi&#xF3;n de que es m&#xE1;s f&#xE1;cil escanear los n&#xFA;meros impresos.</p>

<p>Tambi&#xE9;n, por desgracia, seg&#xFA;n fueron transcurriendo los n&#xFA;meros, fui teniendo que asumir m&#xE1;s responsabilidades, hasta el punto que el &#xFA;ltimo n&#xFA;mero publicado, el noveno (hubo un d&#xE9;cimo, pero no lleg&#xF3; a las m&#xE1;quinas), pr&#xE1;cticamente s&#xF3;lo conten&#xED;a material escrito por mi. As&#xED; pues, "Sputnik" desapareci&#xF3; cuando yo ya hab&#xED;a comenzado el instituto. Y mi afici&#xF3;n por la astron&#xE1;utica fue quedando marginada por mi creciente inter&#xE9;s en la inform&#xE1;tica, si bien nunca olvidada.</p>

<p>Aquella experiencia con "Sputnik" me proporcion&#xF3; muchas ense&#xF1;anzas. Y tambi&#xE9;n me vali&#xF3; mis primeras apariciones en los medios de comunicaci&#xF3;n. Recuerdo dos largas entrevistas radiof&#xF3;nicas en directo en la cadena COPE y en Radio Vetusta, y un art&#xED;culo con foto en La Nueva Espa&#xF1;a. Espero tener alguna ocasi&#xF3;n para digitalizar ese material, aunque quiz&#xE1;s mi verg&#xFC;enza impida dar a conocer las grabaciones de un joven de 13 a&#xF1;os hablando en p&#xFA;blico por primera vez en un programa de radio en directo. En cualquier caso, este tema queda abierto para una posterior entrada en mi diario.</p>
		</div>

		<ul class="post-data">

			<li class="comments"></li>

			<li class="posted"><a href="20040714-1427.html">Posted 14 July, 11:27 PM</a><span property="dc:created" content="2004-07-14T23:27:00PDT"/></li>

		</ul>
		<span rel="sioc:has_container" href="http://berrueta.net/blog#berrueta-blog"/>
                <span rel="sioc:has_creator" href="http://berrueta.net/blog#berrueta-user"/>
                <span rel="sioc:link" href="http://berrueta.net/blog/20040714-1427"/>
                <span property="sioc:id" content="128"/>

	</div>

</div>

<div instanceof="sioc:User" xmlns:sioc="http://rdfs.org/sioc/ns#" xmlns:dc="http://purl.org/dc/elements/1.1/" 
xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#" about="http://berrueta.net/blog#berrueta-user">
  <span property="sioc:name" content="Diego Berrueta"/>
  <a rel="rdfs:seeAlso" href="../foaf.rdf"/>
  <a rel="sioc:account_of" href="../foaf.rdf#me"/>
</div>

</div> <!-- closes #content -->



<div id="sidebar">

<h3>Menu</h3>

<ul id="menu">
  <li><a href="../index.html">Home</a></li>
  <li><a href="index.html">Blog</a></li>
  <li><a href="../research/index.html">Research</a>
  <ul>
    <li><a href="../research/publications/index.html">Publications</a></li>
    <li><a href="../research/projects/index.html">Projects</a></li>
    <li><a href="../research/phd-research/index.html">PhD</a></li>
    <li><a href="../research/reviewer/index.html">Reviewer</a></li>
  </ul>
  </li>
  <li><a href="../teaching/index.html">Teaching</a>
  <ul>
    <li><a href="../teaching/courses/index.html">Courses</a></li>
    <li><a href="../teaching/advised-projects/index.html">Advised projects</a></li>
  </ul>
  </li>
  <li><a href="../freesoftware/index.html">Free software</a>
  <ul>
    <li><a href="../freesoftware/projects.html">Projects</a></li>
    <li><a href="../freesoftware/charlas.html">Talks</a></li>
    <li><a href="../freesoftware/publicaciones.html">Publications</a></li>
  </ul>
  </li>
  <li><a href="../personal/index.html">Personal</a>
  <ul>
    <li><a href="http://www.flickr.com/photos/berrueta/">Photos at Flickr</a></li>
    <li><a href="../personal/people.html">People</a></li>
    <li><a href="../personal/trips.html">Past and upcoming trips</a></li>
  </ul>
  </li>
</ul>

<h3>Recent posts</h3>
<ul>
  <li><a href="new-horizons-new-blog.html" title="New horizons, new&#160;blog">New horizons, new&#160;blog</a></li><li><a href="rdfa-developer-and-trioo.html" title="RDFa Developer and&#160;Trioo">RDFa Developer and&#160;Trioo</a></li><li><a href="steamy.html" title="Steamy">Steamy</a></li><li><a href="xsparql.html" title="XSPARQL">XSPARQL</a></li><li><a href="terras.html" title="TeRRAS">TeRRAS</a></li>
</ul>

<!--
<h3>Categories</h3><ul class="category_list">
	<li><a href="http://berrueta.net/category/Apple/">Apple</a></li>
	<li><a href="http://berrueta.net/category/Books/">Books</a></li>
	<li><a href="http://berrueta.net/category/Conferences/">Conferences</a></li>
	<li><a href="http://berrueta.net/category/Free-Software/">Free Software</a></li>
	<li><a href="http://berrueta.net/category/Google/">Google</a></li>
	<li><a href="http://berrueta.net/category/Mountains/">Mountains</a></li>
	<li><a href="http://berrueta.net/category/Movies/">Movies</a></li>
	<li><a href="http://berrueta.net/category/Publications/">Publications</a></li>
	<li><a href="http://berrueta.net/category/Semantic-Web/">Semantic Web</a></li>
	<li><a href="http://berrueta.net/category/Trips/">Trips</a></li>
	<li><a href="http://berrueta.net/category/University/">University</a></li>
</ul>
-->

<p><a href="../rss/index.html%3Fsection=blog"><img class="feedicon" src="../images/4.png" alt="XML icon"/> Syndicate my blog
</a></p>

<p><a href="../archive/index.html">Older posts</a></p>


</div> <!-- closes #sidebar -->



</div> <!-- closes #middle -->



<div id="footer">

	<p id="footertext"><a href="http://validator.w3.org/check?uri=referer">XHTML</a> <a href="http://www.w3.org/2007/08/pyRdfa/extract?uri=referer">with RDFa</a> <!--a href="http://localhost/cgi-bin/RDFa.py?uri=referer">test, don't click here</a--> | <a href="http://jigsaw.w3.org/css-validator/check/referer">CSS</a> | Adapted from a <a href="http://www.kevinpottsdesign.com" title="Kansas City-based web design, graphic design and textpattern expert">design by Kevin Potts</a> | <a href="http://www.graphicpush.com/icons" title="Free Icons and Icon Sets">Icons from graphicPUSH</a> |

	  <a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/3.0/"><img class="ccicon" alt="Creative Commons License" src="http://i.creativecommons.org/l/by-nc-sa/3.0/80x15.png" /></a>
	  (c) Diego Berrueta, 2007. Except otherwise noted, contents are published under a <a
	    rel="license"
	    href="http://creativecommons.org/licenses/by-nc-sa/3.0/">Creative Commons License</a>. Resources listed as publications or projects might be subject to other licenses.
	</p>

</div>



</div> <!-- closes #frame -->


<!-- Google analytics -->
<script src="http://www.google-analytics.com/urchin.js" type="text/javascript">
</script>
<script type="text/javascript">
_uacct = "UA-2220066-1";
urchinTracker();
</script>

</body>

</html>