<?xml version="1.0"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML+RDFa 1.0//EN" "http://www.w3.org/MarkUp/DTD/xhtml-rdfa-1.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">

<head profile="http://www.w3.org/2003/g/data-view">

    <link rel="transformation" href="http://ns.inria.fr/grddl/rdfa/2007/09/19/RDFa2RDFXML.xsl"/>

	<meta http-equiv="content-type" content="application/xhtml+xml; charset=utf-8" />

    <meta name="AUTHOR" content="Diego Berrueta Muñoz" />
    <meta name="COPYRIGHT" content="Copyright (c) 2007 Diego Berrueta Muñoz" />
    <meta name="DESCRIPTION" content="Personal home page and blog of Diego Berrueta" />

    <link rel="alternate" type="application/rss+xml" title="RSS" href="../rss/index.html%3Fsection=blog"/>
    <link rel="meta" type="application/rdf+xml" title="SIOC" href="http://www.w3.org/2007/08/pyRdfa/extract?uri=http://berrueta.net/blog/20040701-0446"/>

	<link rel="home" title="Home" href="../index.html" />

	<link rel="stylesheet" type="text/css" media="screen, projection" href="../sapphire.css" />
	<link rel="stylesheet" type="text/css" media="screen, projection" href="../mine.css" />

	<link rel="stylesheet" type="text/css" media="print" href="../sapphireprint.css" />

	<title>Diego Berrueta: 01 Jun 2004: razones por las que hemos ganado</title>

</head>



<body>



<div id="frame">



<div id="accessibility">

	<a href="20040701-0446.html#content" title="Go to content">Go to content</a> 

	<a href="20040701-0446.html#nav" title="Go to navigation">Go to navigation</a> 

</div> <!-- closes #accessibility -->



<div id="header">

	<h1><a href="../index.html">Diego Berrueta</a></h1>

	<div id="nav">

		<ul>

			<li><a href="../index.html" title="Return to homepage">Home</a></li>

			<li><a href="../blog.html" title="Read blog posts">Blog</a></li>

			<li><a href="http://www.flickr.com/photos/berrueta/" title="Some of my photos">Gallery</a></li>

		</ul>

<!--
		<p><a href="http://berrueta.net/rss/?section=blog" title="RSS Feed">Subscribe</a></p>
-->

	</div> <!-- closes #nav -->

</div> <!-- closes #header -->



<div id="middle">

<div id="content">

	

<div instanceof="sioc:Forum" xmlns:sioc="http://rdfs.org/sioc/ns#" xmlns:dc="http://purl.org/dc/elements/1.1/" about="http://berrueta.net/blog#berrueta-blog">

	
		<div class="post" instanceof="sioc:Post" xmlns:sioc="http://rdfs.org/sioc/ns#" xmlns:dc="http://purl.org/dc/elements/1.1/" about="http://berrueta.net/blog/20040701-0446" >

		<h2><a rel="bookmark" href="20040701-0446.html"><span property="dc:title">01 Jun 2004: razones por las que hemos&#160;ganado</span></a></h2>

		<div property="sioc:content">
		  <p>(This is a reprint of <a href="http://www.asturlinux.org/comunidad/node/208">the original post</a>)</p>
<p>&#xDA;ltimamente estoy escribiendo muy poco en la bit&#xE1;cora, porque dedico mucho tiempo a mi proyecto y a ir haciendo algunas tareas de la asociaci&#xF3;n, como poner a funcionar el filtrado de correo mediante spambayes (la informaci&#xF3;n sobre c&#xF3;mo lo hice est&#xE1; en el <a href="http://www.asturlinux.org/cgi-bin/bugzilla/show_bug.cgi?id=233" target="_parent">parte del bug</a>) o preparar la presentaci&#xF3;n de AsturLiNUX para la pr&#xF3;xima charla a celebrar en Gij&#xF3;n.</p>

<p>Para mi entrada de hoy en este diario, voy a retomar la senda optimista de anteriores art&#xED;culos, y defender que el software libre est&#xE1; venciendo en la guerra, enfrentamiento o competencia que mantiene con el software propietario, y en particular, con Microsoft.</p>

<p>Hace mucho tiempo que yo no soy usuario de Windows, pero <a href="http://pinsa.escomposlinux.org/sromero/linux/pringao/Pringao_Howto.html" target="_parent">no puedo evitar</a> estar en contacto casi continuo con este sistema operativo y sus aplicaciones. Y la impresi&#xF3;n que saco es que los usuarios de software libre vivimos en el para&#xED;so.</p>

<p>Cuando yo empec&#xE9; a probar mis primeras distribuciones Linux (una Slackware y una Debian), uno de los argumentos m&#xE1;s comunes para dar el salto era aquel de la mayor estabilidad de Linux. Ciertamente, era una gran verdad, puesto que el Windows 95 era un castillo de naipes. Hoy en d&#xED;a, la diferencia ya no es tan apabullante, porque las versiones recientes de Windows son m&#xE1;s robustas, y en muchas ocasiones permiten cerrar las aplicaciones desbocadas y continuar trabajando. Por su parte, el software libre tambi&#xE9;n ha recortado diferencias en aspectos en los que Windows llevaba ventaja, como el de los interfaces gr&#xE1;ficos de usuario y las aplicaciones de ofim&#xE1;tica.</p>

<p>Pero hoy en d&#xED;a, ser usuario de Windows (desde la perspectiva de un usuario de software libre convencido pero cr&#xED;tico) es una pesadilla. Tener instalado un Windows XP significa estar expuesto cada pocas semanas un nuevo gusano devastador. Navegar por Internet al estilo de Redmond supone sufrir el ataque permanente de malware escondido como Flash, controles ActiveX, un aluvi&#xF3;n de banners, pop-ups y cookies, la instalaci&#xF3;n no autorizada de infinidad de dialers, spyware, adware, programas residentes con prop&#xF3;sitos oscuros, etc. Un vistazo al aspecto del Internet Explorer de un usuario medio nos revela un interfaz complejo, con m&#xFA;ltiples barras adicionales (Yahoo, Google, etc.) que repiten funcionalidades. Un s&#xED;ntoma claro de que los marcadores web (conocidos como "mis favoritos") y la tecnolog&#xED;a de autocompletado de URLs han fracasado se puede encontrar analizando las cadenas m&#xE1;s buscadas en Google. Echemos ahora un vistazo a la otra aplicaci&#xF3;n onmipresente en Windows: el Messenger. Lo encontraremos lleno de pesta&#xF1;as, botones y publicidad de productos o portales, sin que el usuario sepa decirnos de d&#xF3;nde han llegado o desde cu&#xE1;ndo est&#xE1;n ahi. En la barra de Windows tambi&#xE9;n aparecen un mont&#xF3;n de peque&#xF1;os cuyo origen o funci&#xF3;n son totalmente desconocidos para el usuario (y esa es la prueba irrefutable de que no deber&#xED;an estar all&#xED;).</p>

<p>Para combatir este asalto, el usuario espabilado (seguramente sea un lector de alguna revista quincenal) instala programas para matar los pop-ups, programas para combatir el spyware, programas para detectar virus, programas para mantener limpio su disco duro... Otros, en cambio, optan por ignorar la cuesti&#xF3;n, y prosiguen instalado nuevos cursores para el rat&#xF3;n, o programas de descarga P2P que contribuyen a aumentar la infecci&#xF3;n.</p>

<p>&#xDA;ltimamente vengo observando que algunos de los usuarios m&#xE1;s fan&#xE1;ticos de Microsoft (esos que no probar&#xE1;n una Knoppix ni aunque les obligues) han llegado a un punto en el que <i>han perdido la confianza</i> en algunos productos de Microsoft. Uno de los programas que m&#xE1;s decepciones provoca, seg&#xFA;n mi percepci&#xF3;n, es el Media Player. Ciertos windowseros de toda la vida no soportan el caos de codecs y actualizaciones de este programa, y se instalan una alternativa. Les comprendo, porque conseguir instalar en Windows unos codecs recientes sin ser atacado por el spyware, el adware o un dialer es realmente dif&#xED;cil.</p>

<p>Alej&#xE1;ndonos del nivel personal, y entrando ya en el profesional, resulta muy llamativo que en los &#xFA;ltimos meses se est&#xE9;n reiterando las <a href="http://slate.msn.com/id/2103152/" target="_parent">voces</a> que llaman a abandonar los productos m&#xE1;s conflictivos de Microsoft (es decir, el Internet Explorer y el Outlook), por considerar que son un agujero sin fondo. Estas voces se&#xF1;alan que por fin existen alternativas reales, que vienen de la mano del proyecto Mozilla. Pienso que tiene que ser especialmente doloroso para Microsoft que un navegador que crey&#xF3; aniquilado para siempre haya resurgido. Quiz&#xE1;s Microsoft deber&#xED;a reflexionar acerca de las decisiones que ha tomado en el desarrollo de Internet Explorer, y su abandono en los &#xFA;ltimos a&#xF1;os (el IE est&#xE1; parado desde hace tiempo). Tambi&#xE9;n pueden sacar una ense&#xF1;anza los que sosten&#xED;an que el software libre era incompatible con la innovaci&#xF3;n. Firefox est&#xE1; demostrando ser un producto con ideas nuevas.</p>

<p>En estos p&#xE1;rrafos creo haber expuesto por qu&#xE9; me siento optimista en relaci&#xF3;n al software libre. Pienso que en algunos &#xE1;mbitos en los que, tan s&#xF3;lo hace unos a&#xF1;os, Microsoft ten&#xED;a una importante ventaja, hoy est&#xE1;n equilibrados, o incluso el software libre se ha puesto por delante.</p>
		</div>

		<ul class="post-data">

			<li class="comments"></li>

			<li class="posted"><a href="20040701-0446.html">Posted  1 July, 01:46 PM</a><span property="dc:created" content="2004-07-01T13:46:00PDT"/></li>

		</ul>
		<span rel="sioc:has_container" href="http://berrueta.net/blog#berrueta-blog"/>
                <span rel="sioc:has_creator" href="http://berrueta.net/blog#berrueta-user"/>
                <span rel="sioc:link" href="http://berrueta.net/blog/20040701-0446"/>
                <span property="sioc:id" content="123"/>

	</div>

</div>

<div instanceof="sioc:User" xmlns:sioc="http://rdfs.org/sioc/ns#" xmlns:dc="http://purl.org/dc/elements/1.1/" 
xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#" about="http://berrueta.net/blog#berrueta-user">
  <span property="sioc:name" content="Diego Berrueta"/>
  <a rel="rdfs:seeAlso" href="../foaf.rdf"/>
  <a rel="sioc:account_of" href="../foaf.rdf#me"/>
</div>

</div> <!-- closes #content -->



<div id="sidebar">

<h3>Menu</h3>

<ul id="menu">
  <li><a href="../index.html">Home</a></li>
  <li><a href="index.html">Blog</a></li>
  <li><a href="../research/index.html">Research</a>
  <ul>
    <li><a href="../research/publications/index.html">Publications</a></li>
    <li><a href="../research/projects/index.html">Projects</a></li>
    <li><a href="../research/phd-research/index.html">PhD</a></li>
    <li><a href="../research/reviewer/index.html">Reviewer</a></li>
  </ul>
  </li>
  <li><a href="../teaching/index.html">Teaching</a>
  <ul>
    <li><a href="../teaching/courses/index.html">Courses</a></li>
    <li><a href="../teaching/advised-projects/index.html">Advised projects</a></li>
  </ul>
  </li>
  <li><a href="../freesoftware/index.html">Free software</a>
  <ul>
    <li><a href="../freesoftware/projects.html">Projects</a></li>
    <li><a href="../freesoftware/charlas.html">Talks</a></li>
    <li><a href="../freesoftware/publicaciones.html">Publications</a></li>
  </ul>
  </li>
  <li><a href="../personal/index.html">Personal</a>
  <ul>
    <li><a href="http://www.flickr.com/photos/berrueta/">Photos at Flickr</a></li>
    <li><a href="../personal/people.html">People</a></li>
    <li><a href="../personal/trips.html">Past and upcoming trips</a></li>
  </ul>
  </li>
</ul>

<h3>Recent posts</h3>
<ul>
  <li><a href="new-horizons-new-blog.html" title="New horizons, new&#160;blog">New horizons, new&#160;blog</a></li><li><a href="rdfa-developer-and-trioo.html" title="RDFa Developer and&#160;Trioo">RDFa Developer and&#160;Trioo</a></li><li><a href="steamy.html" title="Steamy">Steamy</a></li><li><a href="xsparql.html" title="XSPARQL">XSPARQL</a></li><li><a href="terras.html" title="TeRRAS">TeRRAS</a></li>
</ul>

<!--
<h3>Categories</h3><ul class="category_list">
	<li><a href="http://berrueta.net/category/Apple/">Apple</a></li>
	<li><a href="http://berrueta.net/category/Books/">Books</a></li>
	<li><a href="http://berrueta.net/category/Conferences/">Conferences</a></li>
	<li><a href="http://berrueta.net/category/Free-Software/">Free Software</a></li>
	<li><a href="http://berrueta.net/category/Google/">Google</a></li>
	<li><a href="http://berrueta.net/category/Mountains/">Mountains</a></li>
	<li><a href="http://berrueta.net/category/Movies/">Movies</a></li>
	<li><a href="http://berrueta.net/category/Publications/">Publications</a></li>
	<li><a href="http://berrueta.net/category/Semantic-Web/">Semantic Web</a></li>
	<li><a href="http://berrueta.net/category/Trips/">Trips</a></li>
	<li><a href="http://berrueta.net/category/University/">University</a></li>
</ul>
-->

<p><a href="../rss/index.html%3Fsection=blog"><img class="feedicon" src="../images/4.png" alt="XML icon"/> Syndicate my blog
</a></p>

<p><a href="../archive/index.html">Older posts</a></p>


</div> <!-- closes #sidebar -->



</div> <!-- closes #middle -->



<div id="footer">

	<p id="footertext"><a href="http://validator.w3.org/check?uri=referer">XHTML</a> <a href="http://www.w3.org/2007/08/pyRdfa/extract?uri=referer">with RDFa</a> <!--a href="http://localhost/cgi-bin/RDFa.py?uri=referer">test, don't click here</a--> | <a href="http://jigsaw.w3.org/css-validator/check/referer">CSS</a> | Adapted from a <a href="http://www.kevinpottsdesign.com" title="Kansas City-based web design, graphic design and textpattern expert">design by Kevin Potts</a> | <a href="http://www.graphicpush.com/icons" title="Free Icons and Icon Sets">Icons from graphicPUSH</a> |

	  <a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/3.0/"><img class="ccicon" alt="Creative Commons License" src="http://i.creativecommons.org/l/by-nc-sa/3.0/80x15.png" /></a>
	  (c) Diego Berrueta, 2007. Except otherwise noted, contents are published under a <a
	    rel="license"
	    href="http://creativecommons.org/licenses/by-nc-sa/3.0/">Creative Commons License</a>. Resources listed as publications or projects might be subject to other licenses.
	</p>

</div>



</div> <!-- closes #frame -->


<!-- Google analytics -->
<script src="http://www.google-analytics.com/urchin.js" type="text/javascript">
</script>
<script type="text/javascript">
_uacct = "UA-2220066-1";
urchinTracker();
</script>

</body>

</html>